{
  "topbar.store": "Store:",
  "topbar.staff": "Staff:",
  "topbar.customer": "Customer:",
  "topbar.storeUnset": "(Not set)",
  "topbar.staffUnset": "(Not set)",
  "topbar.customerUnselected": "(Not selected)",
  "topbar.reset": "Reset",
  "topbar.helpHide": "Hide description",
  "topbar.helpShow": "Show description",
  "topbar.lang.ko": "한국어",
  "topbar.lang.en": "English",
  "topbar.lang.zh-Hant": "繁體中文 (CHT)",
  "toast.title": "Notice",
  "toast.langChanged": "Language has been changed. The screen description and UI will display in the selected language.",

  "screen.list.title": "HK POS eSignature",
  "screen.list.subtitle": "Screen design (iPad / Tablet)",
  "screen.list.flowTitle": "Workflow",
  "screen.list.flowIntro": "This system is designed as a step-by-step screen flow. Each step proceeds in sequence, based on a scenario using test data.",
  "screen.list.step0": "Step 0\nLogin",
  "screen.list.step1": "Step 1\nCustomer search",
  "screen.list.step2": "Step 2\nForm & BC selection",
  "screen.list.step3": "Step 3\nData entry",
  "screen.list.step4": "Step 4\nFinal review",
  "screen.list.step5": "Step 5\nComplete",
  "screen.list.viewProcess": "View detailed process →",
  "screen.list.start": "Get started",
  "screen.list.guide": "This screen design is a scenario-based demo using test data. Steps proceed in order: Login → Customer search → Form selection → Entry/Review.",
  "screen.list.usageTitle": "How to use the demo",
  "screen.list.usageOrder": "Order: Step 0 (Login) → Step 1 (Customer search) → Step 2 (Form & BC selection) → Step 3 (Data entry) → Step 4 (Final review) → Step 5 (Complete).",
  "screen.list.usageSearch": "Customer search: Enter a keyword to filter demo customers. Select a customer to proceed.",
  "screen.list.usageForm": "Form selection: Select multiple items; selected forms will appear as tabs on the next screen.",
  "screen.list.usageSign": "Signature: If one or more forms require a signature, the signature area is shown. One signature applies to all such forms.",
  "screen.list.usageReset": "Reset: Resets demo state (selected customer/items/signature) to initial.",
  "screen.list.demoNote": "This demo is for understanding the UX flow. Actual operations (POS integration/validation/save/send) are out of scope.",

  "screen.login.title": "Store user login",
  "screen.login.subtitle": "Login with store staff account",
  "screen.login.screenTitle": "Screen description",
  "screen.login.screenDesc": "This screen is for logging in with a store staff account to start a session. Logged-in staff information is used only as the base context for customer lookup and form completion.",
  "screen.login.columnTitle": "Column description",
  "screen.login.staffIdDesc": "Staff ID: Identifier for store staff.",
  "screen.login.passwordDesc": "Password: Used to authenticate the staff account.",
  "screen.login.usageTitle": "Usage",
  "screen.login.loginAction": "Login: After validation, proceed to the next step (Customer search).",
  "screen.login.validation": "Validation: If required fields are missing, an message is shown and progression is blocked.",
  "screen.login.testDataTitle": "Test data",
  "screen.login.designNoteTitle": "Design note:",
  "screen.login.designSummary": "Behaviour summary (for implementation):",
  "screen.login.designAuth": "Authentication: On success, store staff info in session/global state for use as “current logged-in staff”.",
  "screen.login.designSession": "Session/context: Logged-in staff is used across the flow (customer search, form selection, entry, review).",
  "screen.login.designForm": "Form validation: Validate required fields (e.g. staff ID, password) on the client and block progression with a message if missing.",
  "screen.login.designStore": "Store/brand is mapped to the staff account; no separate input. Password policy follows POS.",

  "screen.customerSearch.title": "Main — Customer search",
  "screen.customerSearch.subtitle": "Customer identification and POS service matching",
  "screen.customerSearch.screenDesc": "This step identifies the customer and confirms the “customer context” needed for consultation/consent/contract forms. The left tablet preview follows the actual service UI (portrait 768×1024).",
  "screen.customerSearch.columnPhone": "Phone: Customer phone number (e.g. 91234567).",
  "screen.customerSearch.columnName": "Name: Customer name (e.g. Lee).",
  "screen.customerSearch.columnEmail": "Email: Customer email (e.g. name@example.com).",
  "screen.customerSearch.columnResult": "Search result: Name, tier, phone, email, customer ID.",
  "screen.customerSearch.usageSearch": "Search: Enter phone / name / email. Conditions are combined with AND.",
  "screen.customerSearch.usageMinLength": "Minimum length: Phone ≥4, name ≥2, email ≥6 including '@'. Otherwise search is restricted and a message is shown below the search area.",
  "screen.customerSearch.usageQuery": "Search: After entering at least one valid condition, run search to see results.",
  "screen.customerSearch.usageSelect": "Select customer: Choose one from the result; that customer’s card is highlighted. No navigation yet.",
  "screen.customerSearch.usageNext": "Next: After selecting, click Next to go to Form & BC selection. From there, “Change customer” returns to customer search; “Next” goes to Data entry.",
  "screen.customerSearch.testDataHint": "The “Fill” on the right only fills search fields. Run Search on the left tablet to see results.",
  "screen.customerSearch.designBrand": "Customers are managed per brand; only customers of the logged-in store’s brand are shown (excluding withdrawn).",
  "screen.customerSearch.designOptimize": "Search optimization: Enforce minimum length on the client to reduce unnecessary API calls.",
  "screen.customerSearch.designCombine": "Search conditions: Phone/name/email are combined with AND.",
  "screen.customerSearch.designDisplay": "Results are shown as cards; the selected customer is highlighted.",
  "screen.customerSearch.designMinLength": "In production, minimum length helps avoid excessive result sets. Too short input can return many rows.",

  "screen.consultationSelection.title": "Form & BC selection",
  "screen.consultationSelection.subtitle": "Step 2 / 5 • Select forms and responsible BC",
  "screen.consultationSelection.screenDesc": "With a customer selected, this step is for choosing which forms to complete and which BC (consultant) is responsible. The top shows customer info and available packages; the middle has BC selection; the bottom has checkboxes for forms. Selected forms become tabs in the next step.",
  "screen.consultationSelection.columnIntro": "Forms are grouped into 5 categories by purpose.",
  "screen.consultationSelection.columnCat1": "1. Consultation & info (1)",
  "screen.consultationSelection.columnCat2": "2. Treatment consent (6)",
  "screen.consultationSelection.columnCat3": "3. Transaction & contract (2)",
  "screen.consultationSelection.columnCat4": "4. Customer service (3)",
  "screen.consultationSelection.columnCat5": "5. Other consent / authorisation (1)",
  "screen.consultationSelection.columnPackageList": "Available packages: name, remaining qty/value, expiry, issuing store, voucher no., issue date, status",
  "screen.consultationSelection.usage1": "Customer info: Selected customer's name, grade, phone, email, customer ID are shown.",
  "screen.consultationSelection.usage2": "Available packages: Expand the section to see the customer's packages in a table.",
  "screen.consultationSelection.usage3": "Form selection: Check one or more forms. (In practice, refer to package list to choose required forms.)",
  "screen.consultationSelection.usage4": "BC selection: Choose one consultant from the same store (cards). The selected BC is used in later steps.",
  "screen.consultationSelection.usage5": "Selected count is shown in the footer.",
  "screen.consultationSelection.usage6": "Next: Enabled when BC and at least one form are selected; goes to data entry.",
  "screen.consultationSelection.usage7": "Change customer: Returns to customer search.",
  "screen.consultationSelection.designNote1": "In real POS flow, staff check the customer's packages before selecting forms.",
  "screen.consultationSelection.designNote2": "Member data changes (e.g. refund) are handled in POS; this system does not support edits.",
  "screen.consultationSelection.designCatalog": "Form catalog: Group forms by category; keep category structure in data.",
  "screen.consultationSelection.designCheckbox": "Checkbox state: Allow multiple forms; store selection in array/set; update count in real time.",
  "screen.consultationSelection.designBC": "BC selection: Required. Filter by same store; use selected BC in form/review steps.",
  "screen.consultationSelection.designPackage": "Packages: Show as accordion; manage open/close state; load from POS API.",
  "screen.consultationSelection.designValidation": "Validation: Enable Next only when BC and ≥1 form selected; show message if not.",
  "screen.consultationSelection.designData": "Pass selected forms and BC to next step; create tabs; inject BC as Responsible Staff. Change customer returns to search.",
  "screen.consultationSelection.designNoteSign": "Signature area is shown only when at least one form requires a signature.",

  "screen.tabs.title": "Data entry",
  "screen.tabs.subtitle": "Step 3 / 5 • Form data entry and signature",
  "screen.review.title": "Final review",
  "screen.review.subtitle": "Step 4 / 5 • Review and submit",
  "screen.completion.title": "Complete",
  "screen.completion.subtitle": "Step 5 / 5 • POS result",

  "wrapper.tabs.screenDesc": "This step is for entering data for the selected forms. At the top, <strong>store information</strong> and <strong>BC (consultant) information</strong> are shown read-only (from Step 2). Selected forms appear as thumbnails; below, each form’s input area is shown as a section. If one or more forms require a signature, the signature area is shown; one signature applies to all such forms.",
  "wrapper.tabs.column1": "Store & staff: Store name and BC name are shown read-only at the top (from Step 2). This is auto-injected into the form’s \"Responsible Staff\" field.",
  "wrapper.tabs.column2": "Selected forms: Form count and thumbnail menu (horizontal scroll, sticky).",
  "wrapper.tabs.column3": "Form sections: Input area per form (loaded via iframe, tab UI, vertical scroll).",
  "wrapper.tabs.column4": "Reset form: Button at the bottom of each form. A confirmation dialog appears; on confirm, all inputs for that form are reset. POS-linked fields (read-only) are kept.",
  "wrapper.tabs.column5": "Consent checkbox: Consent checkbox at the bottom of each form (required). All forms’ consent must be checked to proceed.",
  "wrapper.tabs.column6": "Signature area: Customer real name and signature (shown when at least one form requires signature).",
  "wrapper.tabs.usage1": "Switch form: Click a thumbnail to switch to that form tab. Data is preserved when switching.",
  "wrapper.tabs.usage2": "Data entry: Enter required fields. POS-linked fields (customer, package, etc.) are read-only.",
  "wrapper.tabs.usage3": "Reset form: Click \"Reset Form\" at the bottom of a form to clear all inputs. A confirmation dialog appears. POS-linked fields are kept; date fields reset to today.",
  "wrapper.tabs.usage4": "Consent (required): You must check the consent checkbox at the bottom of each form. You cannot proceed until all are checked.",
  "wrapper.tabs.usage5": "Real name: If any form requires a signature, enter the customer’s real name in the signature area. (Required for evidence; POS may not have the real name.)",
  "wrapper.tabs.usage6": "Signature: After entering the real name, collect the signature. One signature applies to all forms that require it.",
  "wrapper.tabs.usage7": "Clear: Use the \"Clear\" button in the signature area to remove the signature and real name and re-enter.",
  "wrapper.tabs.usage8": "Reselect: To change forms, click this button. A confirmation dialog appears; on confirm, all current input is cleared and you return to form selection.",
  "wrapper.tabs.usage9": "Next: After checking all consent checkboxes and, if needed, entering real name and signature, click Next to go to the final review step. Validation errors are shown if any check fails.",
  "wrapper.tabs.testDataDesc": "Each form has an <strong>Auto-fill</strong> button at the top right. Click it to fill sample data into that form’s fields. (Store, staff, customer are injected from the parent; auto-fill fills the rest.)",
  "wrapper.tabs.testDataListHint": "List below: Forms selected in Step 2 (filled from storage on load).",
  "wrapper.tabs.designNoteIntro": "Your real environment (framework, platform, backend API) may differ from this demo. Consider the following when implementing.",
  "wrapper.tabs.designData": "Data structure: Define inject/collect data per form as JSON. Separate POS-linked fields (customer, store, staff, document ID) from user input; align with your API spec.",
  "wrapper.tabs.designConsent": "Consent & signature: Validation of consent checkboxes for all forms is required. One signature applies to all forms that require it. Customer real name is for evidence; collect it when POS does not have it.",
  "wrapper.tabs.designCatalog": "Form catalog: Manage form list, keys, file paths, and signature requirement in config. Branch or map by form key for inject/collect logic.",
  "wrapper.tabs.designDetail": "Reference: Form field list and PDF rules in forms-checklist.md; inject/collect in assets/form-handler.js; catalog in assets/config.js.",
  "wrapper.tabs.designSchema": "JSON schema: Form-level inject/collect fields are in schemas/form-data-schemas.json (common_inject, inject_extra, collect).",
  "wrapper.tabs.designSchemaTitle": "Form data structure (reference)",
  "wrapper.tabs.designSchemaDesc": "Form inject/collect field definitions are in separate files. See view-form-schemas.html for all 13 forms and field types; raw data in form-data-schemas.json.",
  "wrapper.tabs.openSchemaView": "View as table (view-form-schemas.html)",

  "wrapper.review.screenDesc": "This step is for final review of all form content entered by the customer. Content is read-only so the BC cannot alter it. After confirming real name and signature, choose how to deliver the content to the customer and optionally enter notes, then submit. The responsible BC was already chosen in Step 2 and is not shown again here.",
  "wrapper.review.column1": "Review: Selected form list and thumbnail menu (horizontal scroll, sticky).",
  "wrapper.review.column2": "Form review area: Each form’s content is shown (PDF template loaded in iframe, data injected via postMessage, read-only).",
  "wrapper.review.column3": "Customer confirmation: Entered real name and collected signature (auto-injected into PDF template).",
  "wrapper.review.column4": "Delivery method: How to deliver the completed content to the customer (email, print, none). Same card UI as BC selection; selected card shows check and highlight. (Default: none.)",
  "wrapper.review.column5": "Notes: Optional notes.",
  "wrapper.review.column6": "Responsible BC: Already chosen in Step 2; not shown here. Selected BC is auto-injected into the PDF \"Responsible Staff\" field.",
  "wrapper.review.usage1": "Form review: Click thumbnails to switch tabs and review each form’s content.",
  "wrapper.review.usage2": "Content review: All entered content is read-only. Use \"Back\" if you need to edit.",
  "wrapper.review.usage3": "Customer confirmation: Confirm real name and signature in the PDF template. Both are stored as evidence.",
  "wrapper.review.usage4": "Delivery method: In the delivery method area, choose how to deliver the content. Tap a card to select; selected card shows check and highlight. (Default: none.)",
  "wrapper.review.usage5": "Notes: Enter notes if needed. (Optional.)",
  "wrapper.review.usage6": "Back: Go back to the data entry step if you need to change content.",
  "wrapper.review.usage7": "Complete: After reviewing everything and choosing delivery method, click \"Complete\" to submit and go to the completion step. BC was already chosen in Step 2.",
  "wrapper.review.designTitle": "Structure and implementation notes:",
  "wrapper.review.designPdf": "PDF template: Load a PDF-only template in an iframe (not the input form). Keep the original paper form layout.",
  "wrapper.review.designIframe": "iframe: Each PDF template is in an iframe; disable inner scroll and let the parent handle scroll. Iframe height is adjusted automatically.",
  "wrapper.review.designPostMessage": "postMessage: Parent (review.js) and PDF template iframes communicate via postMessage.",
  "wrapper.review.designInject": "Data inject (parent → child): Send form-data-inject with all collected data; template injects into elements with data-field.",
  "wrapper.review.designResize": "Height (child → parent): Send iframe-resize with document height so the parent can adjust iframe height.",
  "wrapper.review.designCollect": "Data collect & inject: Data from the input step is in localStorage; on entering review, collect and inject. Overwrite customer-name with real name (or POS name if no real name).",
  "wrapper.review.designRealName": "Real name: Use customer-entered real name for legal evidence; fallback to POS name if missing.",
  "wrapper.review.designReadOnly": "Read-only: All PDF template fields are read-only.",
  "wrapper.review.designConditional": "Conditional sections: Control with data-conditional.",
  "wrapper.review.designOthers": "Others/Yes (specify): When empty, show only a bottom border (one line).",
  "wrapper.review.designProdTitle": "Production considerations:",
  "wrapper.review.designSecurity": "iframe security: In production, validate postMessage origin.",
  "wrapper.review.designPerf": "Performance: Loading many forms at once may impact performance; consider lazy loading.",
  "wrapper.review.designError": "Error handling: Show a clear message on iframe load failure (e.g. 404).",
  "wrapper.review.designA11y": "Accessibility: Set iframe title for screen readers.",

  "wrapper.completion.screenDesc": "Final screen after submission; shows the result from the POS system. On success, a success message and summary of stored consultation info are shown. On error, the error type and whether retry is possible are shown.",
  "wrapper.completion.column1": "Status icon: Success (✓) or error (✕).",
  "wrapper.completion.column2": "Status message: Completion or error message.",
  "wrapper.completion.column3": "POS result: Stored consultation summary or send attempt info (customer, form count, BC, delivery method, notes).",
  "wrapper.completion.column4": "Retry: Button shown when retry is possible (e.g. network or server error).",
  "wrapper.completion.column5": "Back to start: Resets the flow and returns to the login screen.",
  "wrapper.completion.usage1": "Result: Check the POS result area for stored info or error details.",
  "wrapper.completion.usage2": "Retry: For network or server errors, click \"Retry\" to send again. Validation or permission errors are not retryable; fix the issue and try again.",
  "wrapper.completion.usage3": "Back to start: To start a new consultation, click \"Back to start\". A confirmation dialog appears; on confirm, all input is cleared and you return to login.",
  "wrapper.completion.testDataTitle": "Result state",
  "wrapper.completion.testSuccess": "✓ Success",
  "wrapper.completion.testSuccessDesc": "POS save complete",
  "wrapper.completion.testNetwork": "✕ Network error",
  "wrapper.completion.testNetworkDesc": "Retry available",
  "wrapper.completion.testValidation": "✕ Validation error",
  "wrapper.completion.testValidationDesc": "Retry not available (fix required)",
  "wrapper.completion.testServer": "✕ Server error",
  "wrapper.completion.testServerDesc": "Retry available",
  "wrapper.completion.testPermission": "✕ Permission error",
  "wrapper.completion.testPermissionDesc": "Retry not available (no permission)",
  "wrapper.completion.testDataHint": "Click a button to switch the iframe to that state. Refresh the iframe to see the change.",
  "wrapper.completion.designState": "State: Persist submission result (success / error type) in storage or global state. Restore on refresh or deep link if required.",
  "wrapper.completion.designError": "Error handling: Distinguish retryable (network, server) from non-retryable (validation, permission). Control message and retry button visibility accordingly.",
  "wrapper.completion.designRetry": "Retry: Call POS API again with the same payload. Implement retry limit and backoff per operational requirements.",
  "wrapper.completion.designReset": "Reset: \"Back to start\" clears customer, forms, and signature only; keep store and staff. Show a confirmation dialog before clearing.",
  "wrapper.completion.designApi": "API result: Success/error copy comes from the POS API response. Stored consultation is queryable in POS; delivery method (email/print) drives follow-up workflow.",

  "common.screenTitle": "Screen description",
  "common.signatureBadge": "Signature",
  "common.columnTitle": "Column description",
  "common.usageTitle": "Usage",
  "common.testDataTitle": "Test data",
  "common.designNoteTitle": "Design note:",
  "common.designNoteDevTitle": "Design note (for development):",

  "app.login.staffId": "Staff ID",
  "app.login.staffIdPlaceholder": "Enter staff ID",
  "app.login.password": "Password",
  "app.login.passwordPlaceholder": "Enter password",
  "app.login.passwordToggle": "Toggle password visibility",
  "app.login.submit": "Login",
  "app.login.error": "Login failed.",
  "app.login.errorRequired": "Please enter Staff ID and Password.",
  "app.login.errorStaffNotFound": "Unregistered staff ID. Please use a test account on the right.",
  "app.login.errorPasswordWrong": "Incorrect password. (Demo default: 1234)",
  "app.login.toastRequired": "Please enter Staff ID and Password. (Validation for demo)",
  "app.login.toastStaffNotFound": "Unregistered staff ID. (e.g. {ids})",
  "app.login.toastPasswordWrong": "Please check your password. (Demo default: 1234)",
  "app.login.toastSuccess": "Session created for store identification.",
  "common.fillButton": "Fill",
  "toast.fillLoginNotFound": "Login form not found. (Try again after iframe loads)",
  "toast.fillLoginDone": "Staff ID {staffId} has been filled.",
  "toast.customerSelected": "Customer selected",
  "toast.fillSearchTitle": "Auto fill",
  "toast.fillSearchNotFound": "Customer search screen not found.",
  "toast.fillSearchNotFoundIframe": "Customer search screen not found. (Try again after iframe loads)",
  "toast.fillSearchDone": "Search criteria filled. Click Search on the left.",
  "toast.fillSearchTimeout": "Iframe load timed out. Please refresh the page.",
  "testData.searchCase1": "1 result (phone exact)",
  "testData.searchCase1Expect": "1 result",
  "testData.searchCase2": "2+ results (name LIKE)",
  "testData.searchCase2Expect": "2 results",
  "testData.searchCase3": "0 results (email)",
  "testData.searchCase3Expect": "0 results",

  "app.stepper.step1": "Customer search",
  "app.stepper.step2": "Form & BC selection",
  "app.stepper.step3": "Data entry",
  "app.stepper.step4": "Final review",
  "app.stepper.step5": "Complete",
  "app.stepper.ariaLabel": "Step progress",

  "app.customerSearch.searchTitle": "Search",
  "app.customerSearch.phone": "Phone",
  "app.customerSearch.phonePlaceholder": "e.g. 91234567",
  "app.customerSearch.name": "Name",
  "app.customerSearch.namePlaceholder": "e.g. CHAN TAI MAN",
  "app.customerSearch.email": "Email",
  "app.customerSearch.emailPlaceholder": "e.g. name@example.com",
  "app.customerSearch.clear": "Reset",
  "app.customerSearch.searchBtn": "Search",
  "app.customerSearch.resultTitle": "Search results",
  "app.customerSearch.resultCount": "Search results ({count})",
  "app.customerSearch.resultPlaceholder": "Search results will appear here.",
  "app.customerSearch.noMatch": "No matching customers.",
  "app.customerSearch.noMatchHint": "No matching customers. Please check your input.",
  "app.customerSearch.selectOneCustomer": "Please select one customer from the search results.",
  "app.customerSearch.next": "Next",
  "app.customerSearch.nameLabel": "Name:",
  "app.customerSearch.phoneLabel": "Phone:",
  "app.customerSearch.emailLabel": "Email:",
  "app.customerSearch.customerIdLabel": "Customer ID:",
  "app.customerSearch.availablePackages": "Available packages",
  "app.customerSearch.packagesCount": "({count} items)",
  "app.customerSearch.packageName": "Package name",
  "app.customerSearch.remainQtyValue": "Remaining qty / value",
  "app.customerSearch.expiryDate": "Expiry date",
  "app.customerSearch.issueStore": "Issue store",
  "app.customerSearch.noPackages": "No available packages.",
  "app.customerSearch.remainQtyUnit": "times",
  "app.consultationSelection.noCustomerToastTitle": "No customer",
  "app.consultationSelection.noCustomerToastDesc": "Please start from the customer search step.",

  "app.consultationSelection.customerInfo": "Customer information",
  "app.consultationSelection.customerTitle": "Ms. Mrs. Mr.",
  "app.consultationSelection.customerName": "Name",
  "app.consultationSelection.memberNo": "Member No.",
  "app.consultationSelection.phoneNo": "Phone No.",
  "app.consultationSelection.emailLabel": "Email",
  "app.consultationSelection.memberGrade": "Member Grade",
  "app.consultationSelection.noCustomer": "No customer information.",
  "app.consultationSelection.formsToFill": "Forms to complete",
  "app.consultationSelection.bcLabel": "Responsible BC (required)",
  "app.consultationSelection.changeCustomer": "Change customer",
  "app.consultationSelection.next": "Next",
  "app.consultationSelection.selectedCount": "You will complete forms for {count} selected item(s).",
  "app.consultationSelection.bcSelectedToast": "BC selected",
  "app.consultationSelection.formRequiredToast": "Form selection required",
  "app.consultationSelection.formRequiredDesc": "Please select at least one form.",
  "app.consultationSelection.bcRequiredToast": "BC selection required",
  "app.consultationSelection.bcRequiredDesc": "Please select a responsible BC.",
  "app.consultationSelection.formsSelectedToast": "Forms selected",
  "app.consultationSelection.formsSelectedDesc": "{count} tab(s) will be created on the next screen.",

  "app.tabs.selectedForms": "Selected forms",
  "app.tabs.formsCount": "{count}",
  "app.tabs.customerConfirm": "Customer confirmation",
  "app.tabs.realNameLabel": "Full name (required)",
  "app.tabs.realNamePlaceholder": "Enter your full legal name",
  "app.tabs.signatureLabel": "Signature (required)",
  "app.tabs.clearSignature": "Clear",
  "app.tabs.reselect": "Reselect",
  "app.tabs.next": "Next",

  "app.review.customerLabel": "Customer:",
  "app.review.customerUnselected": "(Not selected)",
  "app.review.reviewTitle": "Review entered content",
  "app.review.formsCount": "{count}",
  "app.review.deliveryMethod": "Delivery method",
  "app.review.notesLabel": "Other notes (optional)",
  "app.review.notesPlaceholder": "Enter any other notes",
  "app.review.back": "Back",
  "app.review.complete": "Complete",

  "app.completion.statusSuccess": "Submission completed",
  "app.completion.messageSuccess": "Consultation information has been saved successfully.",
  "app.completion.posResultTitle": "POS result",
  "app.completion.retry": "Retry",
  "app.completion.backToStart": "Back to start",
  "app.completion.error.title": "Submission failed",
  "app.completion.error.network.message": "Submission failed due to a network error.",
  "app.completion.error.network.detail": "Please check your connection and try again.",
  "app.completion.error.validation.message": "A validation error occurred.",
  "app.completion.error.validation.detail": "Please check and correct your entries, then try again.",
  "app.completion.error.server.message": "A server error occurred.",
  "app.completion.error.server.detail": "Please try again later. Contact support if the problem persists.",
  "app.completion.error.permission.message": "A permission error occurred.",
  "app.completion.error.permission.detail": "You do not have permission to submit. Contact your administrator.",
  "app.completion.result.attemptInfoTitle": "Submission attempt",
  "app.completion.result.storedInfoTitle": "Saved consultation information",
  "app.completion.result.customerLabel": "Customer:",
  "app.completion.result.formsLabel": "Selected forms:",
  "app.completion.result.bcLabel": "Assigned BC:",
  "app.completion.result.deliveryLabel": "Delivery method:",
  "app.completion.result.notesLabel": "Other notes:",
  "app.completion.result.sendFailedTitle": "Submission failed",
  "app.completion.result.errorTypeLabel": "Error type:",
  "app.completion.errorType.network": "Network error",
  "app.completion.errorType.validation": "Validation error",
  "app.completion.errorType.server": "Server error",
  "app.completion.errorType.permission": "Permission error",
  "app.completion.posSavedTitle": "POS save complete",
  "app.completion.posSavedDesc": "Consultation information has been saved successfully in the POS system.",
  "app.completion.toastRetrySuccessTitle": "Retry successful",
  "app.completion.toastRetrySuccessDesc": "Consultation information has been saved successfully.",
  "app.completion.toastRetryFailTitle": "Retry failed",
  "app.completion.toastRetryFailDesc": "Please try again.",
  "app.delivery.email": "Email",
  "app.delivery.print": "Print",
  "app.delivery.none": "Do not deliver",

  "common.none": "(None)",

  "confirm.reset": "Reset demo data?\n\nAll staff/customer/selected items/signature data will be cleared and you will be taken to the home screen.",
  "confirm.reselectForm": "Return to form selection? Current entries will be cleared.",
  "confirm.backToStart": "Go back to the start? All entries will be cleared and you will return to the login screen.",
  "confirm.backToStartCompletion": "Return to the start?\nOnly customer/form/signature data will be cleared; store and staff info will be kept.",

  "form.member-consultation.title": "Member consultation form",
  "form.member-consultation.titleShort": "Member form",
  "form.member-consultation.category": "Consultation & information",
  "form.member-consultation.note": "Collects lifestyle/health/skin concerns for consultation.",
  "form.device-consent-aqua-peel.title": "Device consent - Aqua Peel",
  "form.device-consent-aqua-peel.titleShort": "Aqua Peel",
  "form.device-consent-aqua-peel.category": "Treatment consent",
  "form.device-consent-aqua-peel.note": "Risk disclosure and customer consent for Aqua Peel treatment.",
  "form.device-consent-skincool.title": "Device consent - Skincool",
  "form.device-consent-skincool.titleShort": "Skincool",
  "form.device-consent-skincool.category": "Treatment consent",
  "form.device-consent-skincool.note": "Risk disclosure and customer consent for Skincool treatment.",
  "form.device-consent-ultrasonic.title": "Device consent - Ultrasonic",
  "form.device-consent-ultrasonic.titleShort": "Ultrasonic",
  "form.device-consent-ultrasonic.category": "Treatment consent",
  "form.device-consent-ultrasonic.note": "Risk disclosure and customer consent for Ultrasonic treatment.",
  "form.device-consent-mrv.title": "Device consent - MRV",
  "form.device-consent-mrv.titleShort": "MRV",
  "form.device-consent-mrv.category": "Treatment consent",
  "form.device-consent-mrv.note": "Risk disclosure and customer consent for MRV treatment.",
  "form.treatment-conversion.title": "Treatment conversion confirmation",
  "form.treatment-conversion.titleShort": "Conversion",
  "form.treatment-conversion.category": "Treatment consent",
  "form.treatment-conversion.note": "Confirms treatment/package conversion based on POS.",
  "form.treatment-extension.title": "Treatment extension confirmation",
  "form.treatment-extension.titleShort": "Extension",
  "form.treatment-extension.category": "Treatment consent",
  "form.treatment-extension.note": "Confirms extension of treatment validity.",
  "form.package-terms.title": "Purchase – treatment & product package terms",
  "form.package-terms.titleShort": "Package terms",
  "form.package-terms.category": "Transaction & contract",
  "form.package-terms.note": "Agreement to terms for treatment and product packages.",
  "form.collagen-drink-terms.title": "Purchase – Collagen Drink terms",
  "form.collagen-drink-terms.titleShort": "Collagen",
  "form.collagen-drink-terms.category": "Transaction & contract",
  "form.collagen-drink-terms.note": "Agreement to terms for Collagen Drink purchase.",
  "form.customer-refund.title": "Customer refund confirmation",
  "form.customer-refund.titleShort": "Refund",
  "form.customer-refund.category": "Customer service",
  "form.customer-refund.note": "Confirms refund reason and amount.",
  "form.appointment-cancellation-waiver.title": "Appointment cancellation waiver",
  "form.appointment-cancellation-waiver.titleShort": "Cancellation",
  "form.appointment-cancellation-waiver.category": "Customer service",
  "form.appointment-cancellation-waiver.note": "Agreement to waiver conditions for cancellation.",
  "form.product-exchange-delivery.title": "Product exchange & delivery confirmation",
  "form.product-exchange-delivery.titleShort": "Exchange",
  "form.product-exchange-delivery.category": "Customer service",
  "form.product-exchange-delivery.note": "Confirms product exchange and delivery details.",
  "form.authorization-letter.title": "Letter of authorization",
  "form.authorization-letter.titleShort": "Authorization",
  "form.authorization-letter.category": "Other consent / authorization",
  "form.authorization-letter.note": "Agreement to authorize a third party.",
  "form.category.consultation": "Consultation & information",
  "form.category.treatment": "Treatment consent",
  "form.category.transaction": "Transaction & contract",
  "form.category.service": "Customer service",
  "form.category.other": "Other consent / authorization",

  "processFlow.title": "Workflow",
  "processFlow.intro": "This system is designed as a step-by-step screen flow. Each step proceeds in sequence, based on a scenario using test data.",
  "processFlow.start": "Start",
  "processFlow.step0Label": "Step 0: Store & responsible staff identification",
  "processFlow.login1": "Staff ID / Password input",
  "processFlow.api1": "POS API call<br/>Staff/Store info",
  "processFlow.session": "Brand/Store info",
  "processFlow.step1Label": "Step 1: Customer identification & service matching",
  "processFlow.search1": "Search input<br/>Phone/Name/Email",
  "processFlow.api2": "POS API call<br/>Customer search",
  "processFlow.resultLabel": "Search result",
  "processFlow.result1": "1 customer",
  "processFlow.show1": "Show customer info",
  "processFlow.result2Plus": "2+ customers",
  "processFlow.show2": "Show customer list",
  "processFlow.result0": "0 customers",
  "processFlow.error": "Error message",
  "processFlow.select": "Select customer",
  "processFlow.info1": "Customer info lookup",
  "processFlow.info2": "Available Package lookup",
  "processFlow.step2Label": "Step 2: Form selection & BC selection",
  "processFlow.choose": "Select forms to complete<br/>From 13 types",
  "processFlow.bc1": "Consultant (BC) selection",
  "processFlow.gen1": "Form generation",
  "processFlow.gen2Label": "Multiple tasks?",
  "processFlow.tabs": "Create tabs",
  "processFlow.step3Label": "Step 3: Data entry",
  "processFlow.input": "Data input",
  "processFlow.signLabel": "Signature required?",
  "processFlow.collect": "Collect signature",
  "processFlow.step4Label": "Step 4: Final review",
  "processFlow.review": "Review entered content",
  "processFlow.bc2": "Consultant notes input<br/>Selection",
  "processFlow.method": "Delivery method selection",
  "processFlow.api3": "POS API call<br/>Save consultation info",
  "processFlow.step5Label": "Step 5: Complete",
  "processFlow.successMsg": "Show success message",
  "processFlow.resultDisplay": "Show POS result<br/>Saved consultation summary",
  "processFlow.end": "End"
}
